Repository: click-llc/woocommerce-clickuz-gateway
Catalog: i18n/languages/clickuz-*.po
Languages: ru_ru, uz_uz

source: Error in request from click
ru_ru: Ошибка в запросе от CLICK
uz_uz: CLICK tomonidan so'rovda xatolik ro'y berdi

source: Sign check error
ru_ru: Ошибка проверки подписи
uz_uz: Imzoni tekshirishda xatolik

source: User does not exist
ru_ru: Пользователь или заказ не существует
uz_uz: Foydalanuvchi yoki buyurtma mavjud emas

source: Already paid
ru_ru: Уже оплачено
uz_uz: To'lov amalga oshirilgan

source: Incorrect parameter amount
ru_ru: Неверное количество параметров
uz_uz: Parametrlar soni noto'g'ri

source: Click Prepare requested, reserving products.
ru_ru: Поступил Prepare запрос от CLICK, зарезервирование продуктов.
uz_uz: CLICK dan Prepare so'rov

source: Success
ru_ru: Успешно
uz_uz: Muvofaqqiyatli

source: Failed to update user
ru_ru: Ошибка при обновлении пользователя или заказа
uz_uz: Foydalanuvchi yoki buyurtmani o'zgartirishda xatolik yuz berdi

source: Transaction does not exist
ru_ru: Транзакция не существует
uz_uz: Transaksiya mavjud emas

source: Transaction cancelled
ru_ru: Транзакция отменена
uz_uz: Tranzaksiya bekor qilingan

source: Pay
ru_ru: Оплатить
uz_uz: To'lash

source: Proceed payment with CLICK
ru_ru: Оплатить заказ с помощью CLICK
uz_uz: To'lovni CLICK orqali davom ettirish

source: Pay with CLICK
ru_ru: Оплатить с помощью CLICK
uz_uz: CLICK orqali to'lash

source: Enable/Disable
ru_ru: Активировать/Деактивировать
uz_uz: Yoqish / O'chirish

source: Enable pay via CLICK
ru_ru: Активировать оплату с помощью CLICK
uz_uz: CLICK orqali to'lovlarni faollashtirish

source: API credentials
ru_ru: API аутентификация
uz_uz: API Parametrlar

source: Enter your Click.Uz API credentials.
ru_ru: Сюда вводится данные аутентификации полученные от CLICK.
uz_uz: Bu erda CLICK tomonidan olingan autentifikatsiya ma'lumotlari kiritiladi.

source: Merchant ID
ru_ru: ID Поставщика
uz_uz: Ta'minotchi IDsi

source: Merchant User ID
ru_ru: ID Пользователя Поставщика
uz_uz: Ta'minotchi foydalanuvchisi IDsi

source: Merchant Service ID
ru_ru: ID сервиса поставщика
uz_uz: Ta'minotchi service IDsi

source: Secret Key
ru_ru: Секретный ключ
uz_uz: Maxfiy kalit

source: Pay button details
ru_ru: Параметры кнопки оплаты
uz_uz: To'lov knopkasi parametrlari

source: Button type
ru_ru: Тип кнопки
uz_uz: Knopka turi

source: With redirect
ru_ru: С переходом
uz_uz: Saytga o'tish orqali

source: Without redirect
ru_ru: Оплата по карте
uz_uz: To'lov kartasi orqali

source: Button title
ru_ru: Заголовок кнопки
uz_uz: Knopka matni

source: After payment details
ru_ru: После оплаты
uz_uz: To'lov o'tgandan so'ng

source: Status of order after payment
ru_ru: Изменить статус ордера после оплаты
uz_uz: Buyurtma statusi

source: Service parameters
ru_ru: Параметры сервиса
uz_uz: Servis parametrlari

source: Url addesses for changing to set on Merchant cabinet
ru_ru: Адреса которые вставляются в кабинете мерчанта
uz_uz: Ta'minotchi kabinetida kiritish uchun URL adreslar

source: Prepare url
ru_ru: Адрес проверки
uz_uz: Tekshiruv manzili

source: Complete url
ru_ru: Адрес результата
uz_uz: Natijani jo'natish mansili

source: Settings
ru_ru: Настройки
uz_uz: Sozlamalar

source: Woocommerce CLICK Payment Method
ru_ru: Метод оплаты Woocommerce CLICK
uz_uz: Woocommerce CLICK

source: CLICK Payment Method Plugin for WooCommerce
ru_ru: Плагин добавления метода оплаты с помощью CLICK для Woocommerce
uz_uz: Woocommerce uchun CLICK orqali to'lov oshirish qo'shimchasi

source: OOO "Click"
uz_uz: MChJ "Click"
